In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("raw_data .csv")
df2 = df.copy()

In [ ]:
#renaming all coulumn names

df2.columns = ["Id", "Name", "Age", "Country", "Gender", "Income"]
df2

In [6]:
# renaming a single column name or row name
df2.rename(columns = {"Income" : "Salary"})
df2.rename(index = {1 : "First"})

       Id          Name   Age Country   Gender   Income
0       1      John Doe  29.0     USA     Male  55000.0
First   1      John Doe  29.0     USA     Male  55000.0
2       2    Jane Smith   NaN  Canada   Female  62000.0
3       3          Alex   NaN     USA  Unknown  47000.0
4       4  Maria Garcia  34.0   Spain   Female      NaN
5       5        Li Wei  27.0   China     Male  51000.0
6       6           NaN  45.0   India   Female  73000.0
7       7    Ahmed Khan  38.0     NaN     Male  68000.0
8       8    Rachel Lee  29.0     USA   Female  62000.0
9       9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10     10   Emily Davis  31.0     USA      NaN  58000.0

In [11]:
# Function for Sorting values
sorted_df = df2.sort_values(["Income","Age"])

sorted_df

    Id          Name   Age Country   Gender   Income
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
3    3          Alex   NaN     USA  Unknown  47000.0
5    5        Li Wei  27.0   China     Male  51000.0
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
6    6           NaN  45.0   India   Female  73000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN

In [12]:
sorted_df.sort_index()

    Id          Name   Age Country   Gender   Income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [14]:
#Ranking
sorted_df["Ranking"] = sorted_df["Income"].rank()
sorted_df

    Id          Name   Age Country   Gender   Income  Ranking
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0      1.0
3    3          Alex   NaN     USA  Unknown  47000.0      2.0
5    5        Li Wei  27.0   China     Male  51000.0      3.0
0    1      John Doe  29.0     USA     Male  55000.0      4.5
1    1      John Doe  29.0     USA     Male  55000.0      4.5
10  10   Emily Davis  31.0     USA      NaN  58000.0      6.0
8    8    Rachel Lee  29.0     USA   Female  62000.0      7.5
2    2    Jane Smith   NaN  Canada   Female  62000.0      7.5
7    7    Ahmed Khan  38.0     NaN     Male  68000.0      9.0
6    6           NaN  45.0   India   Female  73000.0     10.0
4    4  Maria Garcia  34.0   Spain   Female      NaN      NaN